{ "articles": [{
"title": "Matt LeBlanc Really Got Injured During This 'Friends' Scene, Which Makes A Lot Of Sense",
"image": "https://typeset-beta.imgix.net/uploads/image/2017/8/8/04f718ab-fb8f-40a9-9bed-ea0180f9262c-joey-sling.png?w=740&h=444&fit=crop&crop=faces&auto=format&q=70&dpr=2",
"teaser": "If you consider yourself to be something of a superfan of the show, then you likely recall the Friends episodes where Joey's arm is in a sling. It happens towards the start of the third season of the...",
"author": "Amy Roberts",
"fulltext":"If you consider yourself to be something of a superfan of the show, then you likely recall the Friends episodes where Joey's arm is in a sling. It happens towards the start of the third season of the show and is attributed to Joey (adorably) hurting his arm after having jumped up and down on his bed. However, during Monday night's episode of Jimmy Kimmel Live!, it was revealed that Matt LeBlanc's Friends injury was real, sustained on the set of one of the show's most beloved episodes: 'The One Where No-One's Ready.'\nAs you may recall, that episode (which was the second of the third season) had Joey fighting with Chandler over a chair. The petty dispute escalated to ludicrous proportions, involving hidden underwear, airborne hummus, and some serious lunging. According to the Friends actor, the dispute also escalated to a dislocated shoulder.\nLeBlanc explained about the scene in question:\n'We both look at each other, look at the chair, and neither one of us are sitting in it. So we both race to the chair, and I have to just step over the coffee table and land on this big, huge comfortable chair. I don't even think it qualifies as a stunt. Somehow I ended up completely upside down. I was going to land on my head between the table and the chair, so I put my arm up to break my fall and exploded my shoulder.'\nApparently, the whole audience thought it was all part of the act, and even laughed at him as he staggered off set.\nTo make the painful situation even funnier, LeBlanc also recollected how Anthony Edwards, who played Doctor Green on ER, which was filmed on an adjacent Warner Bros. stage, was watching the episode taping. He approached the actor backstage while he was suffering with the injury, to which LeBlanc apparently said to him, 'wow, did I hit my head too? Because I know you're not a real doctor...'\nSubsequently, Joey spent the next few episodes of the season with his arm in a sling. And though the show provided a convincing enough reason for that to be the case (because, duh, of course Joey would seriously injure himself doing something as childish as jumping on a bed), it was still always obvious that LeBlanc had actually injured himself in real life, too. Now, at least, we know why that was the case."
  }, {
"title": "David Letterman’s Netflix Talk Show Will Fill The Void His 'Late Show' Retirement Left Behind",
"image": "https://typeset-beta.imgix.net/uploads/getty/2017/8/8/c0b57d78-92f5-4ee0-952c-0a23e80fd502-getty-488511697.jpg?w=740&h=444&fit=crop&crop=faces&auto=format&q=70&dpr=2",
"teaser": "When the longtime host of the Late Show retired from late night television in 2015, it probably left a gaping hole in your heart that you have yet to recover from. But don't worry anymore, because Net...",
"author": "Danielle Jackson",
"fulltext":"When the longtime host of the Late Show retired from late night television in 2015, it probably left a gaping hole in your heart that you have yet to recover from. But don't worry anymore, because Netflix announced on Tuesday that Letterman is officially returning to television with a brand new series on the streaming platform.\nAccording to a release from Netflix, the first season of Letterman’s new series, which hasn’t yet been named, will include six hour-long episodes. All of them will feature Letterman conducting long-form interviews with single guests and venturing outside of the studio for other more curiosity-based segments. As of now, the show doesn't have an exact release date, but fans can expect it to drop at some point in 2018.\nLetterman made a name for himself as the longtime — 33 years, to be exact — host of NBC's Late Night and The Late Show on CBS, respectively. He officially signed off the air in 2015, and passed the torch over to Stephen Colbert in an episode that raked in nearly 14 million viewers.\nFollowing the announcement of his return to television, Letterman said in a statement,\n'I feel excited and lucky to be working on this project for Netflix. Here's what I have learned, if you retire to spend more time with your family, check with your family first. Thanks for watching, drive safely.'\nThe host's return to television really couldn't have come at a better time. Not-so-great political news can basically be expected almost every day, and lots of people look to late night talk shows for a bit of comedic relief. It'll be great to see how Letterman handles generating conversations around these topics using his blunt interviewing tactics.\nBut this is huge for Netflix as well, seeing as the streaming platform, which already has a handful of original series that have gained huge followings in recent years, is also trying to become its own force when it comes to talk shows, like Chelsea with Chelsea Handler and Bill Nye Saves the World. Netflix really couldn't have chosen a better host for their next series than David Letterman."
  }]
}
